Tekla Open API Reference for Tekla Structures 2025
WpfComponentCatalog Properties
The WpfComponentCatalog type exposes the following members.
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedName
 Gets or sets the selected component name in the control.
SelectedNumber
 Gets or sets the selected component number in the control.
Top
See Also
Reference
WpfComponentCatalog Class
Tekla.Structures.Dialog.UIControls Namespace